Repository: Evil-Project/Twinskaraoke
Catalog: TwinskaraokeShared/Localization/Localizable.xcstrings
Source language: en
Languages: de, fi, fr, ja, uk, zh_hans, zh_hant

source: Upload Limits
fi: Latausrajat
fr: Limites d’import
ja: アップロードの上限
uk: Ліміти вивантаження
zh_hans: 上传限制
zh_hant: 上傳限制

source: Version %@
fi: Versio %@
ja: バージョン %@
uk: Версія %@
zh_hans: 版本 %@
zh_hant: 版本 %@

source: Watchalongs
fi: Watchalongit
ja: ウォッチアロング
uk: Спільні перегляди
zh_hans: 一起看
zh_hant: 一起看

source: Live radio
fr: Radio en direct
ja: ライブラジオ
uk: Живе радіо
zh_hans: 电台直播
zh_hant: 电台直播

source: Live Radio
fr: Radio en direct
ja: ライブラジオ
uk: Живе радіо
zh_hans: 电台直播
zh_hant: 電台直播

source: LIVE RADIO
fr: RADIO EN DIRECT
ja: ライブラジオ
uk: ЖИВЕ РАДІО
zh_hans: 电台直播
zh_hant: 电台直播

source: %lld min
ja: %lld分
uk: %lld хв
zh_hans: %lld 分钟
zh_hant: %lld 分鐘

source: %lld s
ja: %lld 秒
uk: %lld с
zh_hans: %lld 秒
zh_hant: %lld 秒

source: Hip-Hop
ja: ヒップホップ
uk: Хіп-хоп
zh_hans: 嘻哈
zh_hant: 嘻哈

source: Intro
ja: イントロ
uk: Вступ
zh_hans: 介绍
zh_hant: 介紹

source: Jazz
ja: ジャズ
uk: Джаз
zh_hans: 爵士
zh_hant: 爵士

source: Pop
ja: ポップ
uk: Поп
zh_hans: 流行
zh_hant: 流行

source: Radio
ja: ラジオ
uk: Радіо
zh_hans: 电台
zh_hant: 電台

source: Rock
ja: ロック
uk: Рок
zh_hans: 摇滚
zh_hant: 搖滾

source: Shimeji
ja: しめじ

source: Watchalong
ja: ウォッチアロング
uk: Спільний перегляд
zh_hans: 一起看
zh_hant: 一起看

source: %lld XP
zh_hans: %lld 经验值
zh_hant: %lld 經驗值

source: 10-band parametric EQ. Drag each band between -12 dB and +12 dB.
zh_hans: 10 段参数均衡器。拖动每个频段在 -12 dB 到 +12 dB 之间调整。
zh_hant: 10 段參數等化器。拖曳每個頻段在 -12 dB 到 +12 dB 之間調整。

source: A native SwiftUI client for the Neuro & Evil Karaoke Web Player. Built around the public Neurokaraoke API, with offline downloads, karaoke vocal removal, beat-aware crossfade, and Live Radio playback.
zh_hans: 这是一个 Neuro & Evil 卡拉OK网页播放器的原生 SwiftUI 客户端。基于公共 Neurokaraoke API 构建，具备离线下载、卡拉OK人声消除、节拍匹配交叉混音（Crossfade）和实时电台播放功能。
zh_hant: 這是一個 Neuro & Evil 卡拉OK網頁播放器的原生 SwiftUI 用戶端。基於公共 Neurokaraoke API 建構，具備離線下載、卡拉OK人聲消除、節拍匹配交叉淡入淡出（Crossfade）和即時電台播放功能。

source: Add Favorite Songs
zh_hans: 添加收藏中的歌曲
zh_hant: 加入喜好項目中的歌曲

source: Add Playlist Songs
zh_hans: 添加歌单中的歌曲
zh_hant: 加入歌單的歌曲

source: Add songs to your library when you add them to playlists or favorite them. Sync keeps library changes available across this app on your devices.
zh_hans: 将歌曲添加至歌单或进行收藏时，系统会自动将其添加至您的资料库。同步功能可确保该资料库的更改在您所有设备的此应用中保持一致。
zh_hant: 將歌曲加入歌單或喜好項目時，系統會自動將其加入您的資料庫。同步功能可確保此資料庫的變更在您所有裝置的此 App 中保持一致。

source: Audio Quality
zh_hans: 音质
zh_hant: 音質

source: Auto Mix
zh_hans: 自动混音
zh_hant: 自動混音

source: Auto Mix blends compatible songs automatically. Crossfade uses the fixed duration you choose.
zh_hans: 自动混音 会自动融合相容的歌曲。淡入淡出 则使用您选择的固定时长。
zh_hant: 自動混音 會自動融合相容的歌曲。交錯淡化 則使用您選擇的固定長度。

source: Autoplay Similar Songs
zh_hans: 自动播放相似歌曲
zh_hant: 自動播放相似歌曲

source: High Efficiency
zh_hans: 流畅音质
zh_hant: 流暢音質

source: High Quality
zh_hans: 高音质
zh_hant: 高音質

source: Karaoke
zh_hans: K歌
zh_hant: K歌

source: Karaoke controls
zh_hans: K歌调节
zh_hant: K歌調節

source: Karaoke effects use on-device AI to separate vocals and instrumentals in real time. For best results, use headphones or external speakers.
zh_hans: K歌音效利用端侧 AI 实时分离人声与伴奏。为了获得最佳效果，请使用耳机或外接扬声器
zh_hant: K歌音效利用裝置端 AI 即時分離人聲與伴奏。為達最佳效果，請使用耳機或外接揚聲器

source: Karaoke Playlists
zh_hans: K歌歌单
zh_hant: K歌清單

source: Lossless
zh_hans: 无损音质
zh_hant: 無損音質

source: OK
zh_hans: 好
zh_hant: 好

source: ON AIR
zh_hans: 正在广播
zh_hant: 正在廣播

source: Opens account and sync status.
zh_hans: 打开账号与同步状态
zh_hant: 開啟帳號與同步狀態

source: Opens curated karaoke playlists.
zh_hans: 打开精选卡拉 OK 歌单
zh_hant: 開啟精選卡拉 OK 歌單

source: Opens karaoke search.
zh_hans: 打开卡拉 OK 搜索
zh_hant: 開啟卡拉 OK 搜尋

source: Opens public karaoke playlists
zh_hans: 打开公开卡拉 OK 歌单
zh_hant: 開啟公開卡拉 OK 歌單

source: Opens the full song catalog.
zh_hans: 打开完整曲库
zh_hant: 開啟完整曲庫

source: OR
zh_hans: 或
zh_hant: 或

source: Preferences are saved on this device and use the same account settings style as Music.
zh_hans: 偏好设置将保存在本设备上，并采用与“音乐”相同的账户设置样式
zh_hant: 偏好設定將儲存在此裝置上，並採用與「音樂」相同的帳號設定風格

source: Preparing karaoke
zh_hans: 正在准备卡拉OK
zh_hant: 正在準備卡拉OK

source: Save karaoke tracks from any song menu and they will appear here for offline playback.
zh_hans: 从任意歌曲菜单中保存卡拉 OK 曲目后便会出现在此处以供离线播放
zh_hant: 從任意歌曲選單中儲存卡拉 OK 曲目後便會出現在此處以供離線播放

source: Share artwork
zh_hans: 分享图片
zh_hant: 分享圖片

source: Songs will be analyzed in the background so karaoke modes can switch instantly during playback. This uses more battery and processing power. Separated stems count toward the 4 GB music cache limit.
zh_hans: 歌曲将在后台进行分析，以便在播放时能够即时切换卡拉OK模式。 这会消耗更多电量和处理性能。分离出的音轨将计入 4 GB 音乐缓存限制
zh_hant: 歌曲將在背景進行分析，以便在播放時能夠即時切換卡拉OK模式。 這會消耗更多電量與運算效能。分離後的音軌將計入 4 GB 音樂快取限制。

source: Sync
zh_hans: 同步
zh_hant: 同步

source: Sync Library
zh_hans: 同步资料库
zh_hant: 同步資料庫

source: Tap an indicator to clear that cache. Image cache is limited to 2 GB, music cache (including AI stems) to 4 GB, and lyrics cache to 2 GB. Items older than 6 months are automatically cleaned. Downloads are exempt from these limits.
zh_hans: 轻点指示条可清除对应缓存。图片缓存上限为 2 GB，音乐缓存（含 AI 分轨）上限为 4 GB，歌词缓存上限为 2 GB。超过 6 个月的项目会自动清理。下载内容不受此限制
zh_hant: 輕點指示條可清除對應快取。圖片快取上限為 2 GB，音樂快取（含 AI 分軌）上限為 4 GB，歌詞快取上限為 2 GB。超過 6 個月的項目會自動清理。下載內容不受此限制

source: Turn the Digital Crown or swipe up and down to adjust.
zh_hans: 旋转数码表冠或上下滑动以调整
zh_hant: 旋轉數碼錶冠或上下滑動以調整

source: up to %lld
zh_hans: 最多 %lld
zh_hant: 最多 %lld

source: When enabled, songs you play are saved for offline listening.
zh_hans: 启用此功能后播放的歌曲将被保存以便离线收听
zh_hant: 啟用此功能後播放的歌曲將會儲存以供離線聆聽
